{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 200], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "lstm_5", "class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAABAAAAAUAAAATAAAAcygAAAB8AFwCfQF9AnQAagGIAIgCZgJkAYgBZAKNA30DfAF8\nAnwDFAAXAFMAKQNOZwAAAAAAAAAAKQPaBXNoYXBl2gRtZWFu2gZzdGRkZXYpAtoBS9oNcmFuZG9t\nX25vcm1hbCkE2gRhcmdz2gZ6X21lYW7aC3pfbG9nX3NpZ21h2gdlcHNpbG9uKQPaCmJhdGNoX3Np\nemXaC2Vwc2lsb25fc3Rk2gpsYXRlbnRfZGltqQD1RwAAAC9ob21lL2Vkd2FyZC9EZXNrdG9wL2lT\nWVNsYWIvQ2hhdGJvdHMvQ2hhdGJvdOOAgFYyLjEvbW9kZWxzL2xzdG1fdmFlLnB52ghzYW1wbGlu\nZxgAAABzBgAAAAABCAEUAQ==\n", null, [1, 1.0, 64]], "function_type": "lambda", "output_shape": [64], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAMAAABTAAAAcyYAAAB8AGQBGQB9AXwAZAIZAH0CdAB0AWoCfAKDAWQCGQCD\nAXwBgwFTACkDTukAAAAA6QEAAAApA9oMUmVwZWF0VmVjdG9y2gFL2gVzaGFwZSkD2gRhcmdz2g9s\nYXllcl90b19yZXBlYXTaDnNlcXVlbmNlX2xheWVyqQByCQAAAPVHAAAAL2hvbWUvZWR3YXJkL0Rl\nc2t0b3AvaVNZU2xhYi9DaGF0Ym90cy9DaGF0Ym9044CAVjIuMS9tb2RlbHMvbHN0bV92YWUucHna\nDXJlcGVhdF92ZWN0b3ITAAAAcwYAAAAAAQgBCAE=\n", null, null], "function_type": "lambda", "output_shape": [null, 64], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_3", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"name": "lstm_6", "class_name": "LSTM", "config": {"name": "lstm_6", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "lstm_7", "class_name": "LSTM", "config": {"name": "lstm_7", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 200, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lstm_6", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["lstm_7", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}