{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 200], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "lstm_3", "class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAABAAAAAUAAAATAAAAcygAAAB8AFwCfQF9AnQAagGIAIgCZgJkAYgBZAKNA30DfAF8\nAnwDFAAXAFMAKQNOZwAAAAAAAAAAKQPaBXNoYXBl2gRtZWFu2gZzdGRkZXYpAtoBS9oNcmFuZG9t\nX25vcm1hbCkE2gRhcmdz2gZ6X21lYW7aC3pfbG9nX3NpZ21h2gdlcHNpbG9uKQPaCmJhdGNoX3Np\nemXaC2Vwc2lsb25fc3Rk2gpsYXRlbnRfZGltqQD1RQAAAC9ob21lL2Vkd2FyZC9EZXNrdG9wL2lT\nWVNsYWIvQ2hhdGJvdHMvQ2hhdGJvdOOAgFYyL21vZGVscy9sc3RtX3ZhZS5wedoIc2FtcGxpbmcj\nAAAAcwYAAAAAAQgBFAE=\n", null, [1, 1.0, 64]], "function_type": "lambda", "output_shape": [64], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "repeat_vector_3", "class_name": "RepeatVector", "config": {"name": "repeat_vector_3", "trainable": true, "n": 1}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "decoder_h", "class_name": "LSTM", "config": {"name": "decoder_h", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["repeat_vector_3", 0, 0, {}]]]}, {"name": "decoder_mean", "class_name": "LSTM", "config": {"name": "decoder_mean", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 200, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["decoder_h", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["decoder_mean", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}