{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 300], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAABAAAAAUAAAATAAAAcygAAAB8AFwCfQF9AnQAagGIAIgCZgJkAYgBZAKNA30DfAF8\nAnwDFAAXAFMAKQNOZwAAAAAAAAAAKQPaBXNoYXBl2gRtZWFu2gZzdGRkZXYpAtoBS9oNcmFuZG9t\nX25vcm1hbCkE2gRhcmdz2gZ6X21lYW7aC3pfbG9nX3NpZ21h2gdlcHNpbG9uKQPaCmJhdGNoX3Np\nemXaC2Vwc2lsb25fc3Rk2gpsYXRlbnRfZGltqQD6ky9tZWRpYS9lZHdhcmQvOTAxMGQ0OWEtYmY1\nYi00YjY4LThhYTAtYTdkMDNhOGQxMmU5L0FsbCBwcmV2aW91cyBjaGF0Ym90IGNvZGVzL0Rpc2Nh\ncmRlZCBmb2xkZXJzL2ludGVudF9jYWxjdWxhdG9yX21vZHVsZShiYWNrdXApL21vZGVscy9sc3Rt\nX3ZhZS5wedoIc2FtcGxpbmcYAAAAcwYAAAAAAQgBFAE=\n", null, [1, 1.0, 200]], "function_type": "lambda", "output_shape": [200], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAMAAABTAAAAcyYAAAB8AGQBGQB9AXwAZAIZAH0CdAB0AWoCfAKDAWQCGQCD\nAXwBgwFTACkDTukAAAAA6QEAAAApA9oMUmVwZWF0VmVjdG9y2gFL2gVzaGFwZSkD2gRhcmdzWg9s\nYXllcl90b19yZXBlYXRaDnNlcXVlbmNlX2xheWVyqQByBwAAAPqTL21lZGlhL2Vkd2FyZC85MDEw\nZDQ5YS1iZjViLTRiNjgtOGFhMC1hN2QwM2E4ZDEyZTkvQWxsIHByZXZpb3VzIGNoYXRib3QgY29k\nZXMvRGlzY2FyZGVkIGZvbGRlcnMvaW50ZW50X2NhbGN1bGF0b3JfbW9kdWxlKGJhY2t1cCkvbW9k\nZWxzL2xzdG1fdmFlLnB52g1yZXBlYXRfdmVjdG9yEwAAAHMGAAAAAAEIAQgB\n", null, null], "function_type": "lambda", "output_shape": [null, 200], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "lstm_3", "class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["lstm_3", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}